#include <iostream>;
using namespace std;
int main() {
	//If1.Дано целое число.Если оно является положительным, то прибавить кнему 1; в противном случае не изменять его.Вывести полученное число.
	//int a;
	//cin >> a;
	//if (a > 0); {
	//	a += 1;// a = a + 1; a++;
	//}
	//cout << a << endl;
	//If2.Дано целое число.Если оно является положительным, то прибавить кнему 1; в противном случае вычесть из него 2. Вывести полученное число.
	//int a;
	//cin >> a;
	//if (a > 0); {
	//	a += 1;// a = a + 1; a++;
	//}
	//else {
	//	a -= 2; // a=a-2; 
	//}
	//cout << a << endl;
	//if3.Дано целое число.Если оно является положительным, то прибавить кнему 1; если отрицательным, то вычесть из него 2; если нулевым, тозаменить его на 10. Вывести полученное число.
	/*int a;
	cin >> a;
	if (a > 0) {
		a++;
	}
	else if (a < 0) {
		a -= 2
	}
	else if (a==0) {
		a = 10;
	}
	cout << a << endl;*/
	//If4	.Даны три целых числа.Найти количество положительных чисел в исходном наборе.
	/*int a, b, c;
	int k = 0;
	if (a > 0) {
		k++;
	}
	if (b > 0) {
		k++;
	}
	if (c > 0) {
		k++;
	}
	cout << k << endl;*/
	//If6◦.Даны два числа.Вывести большее из них
	/*int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a << endl;
	}
	else if (b > a) {
		cout << b << endl;
	}
	else if (a == b) {
		cout << "=" << endl;*/

		//If7.Даны два числа.Вывести порядковый номер меньшего из них.
		// у а номер 1,у b номер 2;
	//int a, b;
	//cin >> a >> b;
	//if (a == 1) {
	//	cout << a << endl;
	//}
	//else if (b == 2) {
	//	cout << b << endl;
	//}
	//else if (a == b) {
	//	cout << a << "=" << endl;


	//}
	//If8◦.Даны два числа.Вывести вначале большее, а затем меньшее из них.
	/*int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a << endl;
		cout << a << endl;
	}
	else if (b > a) {
		cout << b << endl;
		cout << a << endl;
	}
	else if (a == b) {
		cout << a << b << endl;*/
		//}
		//If9.Даны две переменные вещественного типа : A, B.Перераспределить значения данных переменных так, чтобы в A оказалось меньшее из значений,а в B — большее.Вывести новые значения переменных A и B.
	/*double a, b,t;
	cin >> a >> b;
	if (a > b ) {
		cout << a << endl;
		cout << b << endl;
	}
	else if (t= (b > a)) {
		cout << b << endl;
		cout << a << endl;
	}
	else if (a == b) {
		cout << a << b << endl;*/
	}
}